{
   "class_name": "Model",
   "config": {
      "name": "AlexNet",
      "layers": [
         {
            "class_name": "InputLayer",
            "config": {
               "batch_input_shape": [
                  null,
                  640,
                  1
               ],
               "dtype": "float32",
               "sparse": false,
               "name": "input_2"
            },
            "name": "input_2",
            "inbound_nodes": []
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_34",
               "trainable": true,
               "dtype": "float32",
               "filters": 64,
               "kernel_size": [
                  16
               ],
               "strides": [
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": "Daubechies3_filter",
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 0.00019999999494757503
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_34",
            "inbound_nodes": [
               [
                  [
                     "input_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_36",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_36",
            "inbound_nodes": [
               [
                  [
                     "conv1d_34",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_9",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_9",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_36",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "ZeroPadding1D",
            "config": {
               "name": "zero_padding1d_1",
               "trainable": true,
               "dtype": "float32",
               "padding": [
                  1,
                  1
               ]
            },
            "name": "zero_padding1d_1",
            "inbound_nodes": [
               [
                  [
                     "activation_9",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "MaxPooling1D",
            "config": {
               "name": "max_pooling1d_4",
               "trainable": true,
               "dtype": "float32",
               "strides": [
                  2
               ],
               "pool_size": [
                  3
               ],
               "padding": "valid",
               "data_format": "channels_last"
            },
            "name": "max_pooling1d_4",
            "inbound_nodes": [
               [
                  [
                     "zero_padding1d_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_51",
               "trainable": true,
               "batch_input_shape": [
                  null,
                  640,
                  1
               ],
               "dtype": "float32",
               "filters": 192,
               "kernel_size": [
                  5
               ],
               "strides": [
                  2
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 0.00019999999494757503
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_51",
            "inbound_nodes": [
               [
                  [
                     "max_pooling1d_4",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_10",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_10",
            "inbound_nodes": [
               [
                  [
                     "conv1d_51",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_53",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_53",
            "inbound_nodes": [
               [
                  [
                     "activation_10",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "MaxPooling1D",
            "config": {
               "name": "max_pooling1d_5",
               "trainable": true,
               "dtype": "float32",
               "strides": [
                  2
               ],
               "pool_size": [
                  3
               ],
               "padding": "valid",
               "data_format": "channels_last"
            },
            "name": "max_pooling1d_5",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_53",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_5",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.25,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout_5",
            "inbound_nodes": [
               [
                  [
                     "max_pooling1d_5",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_52",
               "trainable": true,
               "dtype": "float32",
               "filters": 256,
               "kernel_size": [
                  3
               ],
               "strides": [
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 0.00019999999494757503
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_52",
            "inbound_nodes": [
               [
                  [
                     "dropout_5",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_11",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_11",
            "inbound_nodes": [
               [
                  [
                     "conv1d_52",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_54",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_54",
            "inbound_nodes": [
               [
                  [
                     "activation_11",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "MaxPooling1D",
            "config": {
               "name": "max_pooling1d_6",
               "trainable": true,
               "dtype": "float32",
               "strides": [
                  2
               ],
               "pool_size": [
                  3
               ],
               "padding": "valid",
               "data_format": "channels_last"
            },
            "name": "max_pooling1d_6",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_54",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_6",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.25,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout_6",
            "inbound_nodes": [
               [
                  [
                     "max_pooling1d_6",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_53",
               "trainable": true,
               "dtype": "float32",
               "filters": 384,
               "kernel_size": [
                  3
               ],
               "strides": [
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 0.00019999999494757503
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_53",
            "inbound_nodes": [
               [
                  [
                     "dropout_6",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_12",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_12",
            "inbound_nodes": [
               [
                  [
                     "conv1d_53",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_55",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_55",
            "inbound_nodes": [
               [
                  [
                     "activation_12",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_54",
               "trainable": true,
               "dtype": "float32",
               "filters": 384,
               "kernel_size": [
                  3
               ],
               "strides": [
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 0.00019999999494757503
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_54",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_55",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_13",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_13",
            "inbound_nodes": [
               [
                  [
                     "conv1d_54",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_56",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_56",
            "inbound_nodes": [
               [
                  [
                     "activation_13",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_55",
               "trainable": true,
               "dtype": "float32",
               "filters": 256,
               "kernel_size": [
                  3
               ],
               "strides": [
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 0.00019999999494757503
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_55",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_56",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_14",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_14",
            "inbound_nodes": [
               [
                  [
                     "conv1d_55",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_57",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_57",
            "inbound_nodes": [
               [
                  [
                     "activation_14",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "MaxPooling1D",
            "config": {
               "name": "max_pooling1d_7",
               "trainable": true,
               "dtype": "float32",
               "strides": [
                  2
               ],
               "pool_size": [
                  3
               ],
               "padding": "valid",
               "data_format": "channels_last"
            },
            "name": "max_pooling1d_7",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_57",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "AveragePooling1D",
            "config": {
               "name": "average_pooling1d_1",
               "trainable": true,
               "dtype": "float32",
               "strides": [
                  6
               ],
               "pool_size": [
                  6
               ],
               "padding": "valid",
               "data_format": "channels_last"
            },
            "name": "average_pooling1d_1",
            "inbound_nodes": [
               [
                  [
                     "max_pooling1d_7",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_7",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.25,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout_7",
            "inbound_nodes": [
               [
                  [
                     "average_pooling1d_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Flatten",
            "config": {
               "name": "flatten_1",
               "trainable": true,
               "dtype": "float32",
               "data_format": "channels_last"
            },
            "name": "flatten_1",
            "inbound_nodes": [
               [
                  [
                     "dropout_7",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense_3",
               "trainable": true,
               "dtype": "float32",
               "units": 4096,
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 0.00019999999494757503
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense_3",
            "inbound_nodes": [
               [
                  [
                     "flatten_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_15",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_15",
            "inbound_nodes": [
               [
                  [
                     "dense_3",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_58",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  1
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_58",
            "inbound_nodes": [
               [
                  [
                     "activation_15",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_8",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.5,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout_8",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_58",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense_4",
               "trainable": true,
               "dtype": "float32",
               "units": 1024,
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 0.00019999999494757503
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense_4",
            "inbound_nodes": [
               [
                  [
                     "dropout_8",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_16",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_16",
            "inbound_nodes": [
               [
                  [
                     "dense_4",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_59",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  1
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_59",
            "inbound_nodes": [
               [
                  [
                     "activation_16",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_9",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.5,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout_9",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_59",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense_5",
               "trainable": true,
               "dtype": "float32",
               "units": 13,
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 0.00019999999494757503
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense_5",
            "inbound_nodes": [
               [
                  [
                     "dropout_9",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_17",
               "trainable": true,
               "dtype": "float32",
               "activation": "softmax"
            },
            "name": "activation_17",
            "inbound_nodes": [
               [
                  [
                     "dense_5",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         }
      ],
      "input_layers": [
         [
            "input_2",
            0,
            0
         ]
      ],
      "output_layers": [
         [
            "activation_17",
            0,
            0
         ]
      ]
   },
   "keras_version": "2.2.4-tf",
   "backend": "tensorflow"
}